---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArrayIterator.#ctor
source: html/ba40f774-3c8d-b430-80e9-a03ed219c5c4.htm
---
# Autodesk.Revit.DB.DetailCurveArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public DetailCurveArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.